#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

data.aws_eks_cluster.tc_eks_cluster: Reading...
data.aws_iam_role.labrole: Reading...
data.aws_iam_role.labrole: Read complete after 0s [id=LabRole]
data.aws_eks_cluster.tc_eks_cluster: Read complete after 1s [id=eks_vid-proc]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # helm_release.process will be created
  + resource "helm_release" "process" {
      + atomic                     = false
      + chart                      = "../Helm/process_service-chart"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "process"
      + namespace                  = "dev"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                namespace: default
                
                # API
                apiName: process-service
                apiImage: 
                  name: brunapisera/process-service
                  tag: latest
                apiNodePort: 30200
                
                # Config map
                configmap:
                  name: process-service-config-map
                  data:
                
                rabbitmq:
                  username: xtpbliuz 
                  hostname: woodpecker-01.rmq.cloudamqp.com
                  password: 
                  port: 5672
                  virtualhost: xtpbliuz
                
                # Secret
                secret:
                  name: process-secret
                
                aws:
                  accessKeyId: 
                  secretAccessKey: 
                  sessionToken:
            EOT,
          + <<-EOT
                namespace: dev
                
                # API
                apiName: process-service
                apiImage: 
                  name: brunapisera/process-service
                  tag: latest
                apiNodePort: 30200
                
                # Secret
                secret:
                  name: process-secret
                
                rabbitmq:
                  username: xtpbliuz 
                  hostname: woodpecker-01.rmq.cloudamqp.com
                  password: 
                  port: 5672
                  virtualhost: xtpbliuz
                
                aws:
                  accessKeyId: 
                  secretAccessKey: 
                  sessionToken: 
                  bucketName: videouploadtc
            EOT,
        ]
      + verify                     = false
      + version                    = "0.1.0"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "aws.accessKeyId"
          + value = "ASIAZTYADNEJ6T23CHJK"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "aws.secretAccessKey"
          + value = "miVMHCjz6HnE0oQl5K5uYw69v09APNicqEv//2LS"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "aws.sessionToken"
          + value = "IQoJb3JpZ2luX2VjENr//////////wEaCXVzLXdlc3QtMiJIMEYCIQDGkrcMu368JQvkrbijHvpbbFjs/a4nXjZX8yTAXiCZtwIhAMDmjbrgkE9Qe3bjqwan9M/F+0NZ+aIyza00YbHH9sPeKrYCCGMQAxoMNjYwODg4MzE2MTc5Igx+EXMm51d+7B0NgdEqkwIttpMfIuVFxH3YJ0IJjXcmMtMqSQ50Hw795vbnsIHAvqb7VgBgLXox5TLvsJVGmeySdb/SbasFpFIlqJFgJG5aACPSw26mkq3Orxat3tx30NBbhchtr4ZS8CefSHmuuUwINEQS/TjomtP0r6mHShB0KkuNwobJYFxkBNuAvA6zrkOStC3ISFh6w9D7N5bQSdkmMc+vPAzPmYxudlGCv9PNgbV4xYPq0YyOfsgwbRRtKSZ3bD5arvlnm4qD+WLXOb6A0aUy4K2TFVbUsrq8z5H6TyVidLcWkmAF3ua4QAZkoOGZy7fYEyIzXuHRRhdbZpMkgfuXtBAOLmWqvpcllzVBNODnXlDnNqmB+zEmZDXlgKO5eTD8/oTABjqcAVViYHh66chvb1rlT9iv7noTW/HVzNr7IcHatz9Oc+BkFF3yyKr0LOq69LcfYCAEs4E2K7Q9ytfem2GFEPMdDg0HdOgPrGj/SHzq23z9oRPKfadLYHnmlmGBRjPhWz/Kz2SqDI5pN5Y7L6qd7WuUIoFp8BhJJFEvbO6aY0pVgYzrObXKeBd+raLap4SLyfCZwZSwoye48cy3jSC6xA=="
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "rabbitmq.password"
            # (2 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @AlexisCesar, Action: `pull_request`*